---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.AirViscosity
source: html/b9e62b52-8ca8-f273-a9eb-4f57b29a1364.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.AirViscosity Property

The kinematic viscosity of air for the duct fitting or duct accessory, Units: (ft^2/s).

## Syntax (C#)
```csharp
public double AirViscosity { get; }
```